УРВ_файловая/src/Catalogs/ШаблоныТекстов/ШаблоныТекстов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныТекстов</name>
  <attributes>
    <name>Витрина</name>
    <type>
      <types>CatalogRef.Витрины</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>CatalogRef.ТипыШаблоновТекстов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УРВ_файловая/src/Catalogs/ШаблоныТекстов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
    
    Документ = ТекстХранилище.Получить();
    Если Документ <> Неопределено Тогда
        Текст = Документ.ПолучитьТекст();
    КонецЕсли; 
    
    Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВитринСервисов") Тогда
        Если Не ЗначениеЗаполнено(Сервис) Тогда
            Сервис = БазаЗнанийПовтИсп.СервисВитрины(Витрина);
        КонецЕсли; 
    Иначе
        Если Не ЗначениеЗаполнено(Витрина) Тогда
            Витрина = БазаЗнанийПовтИсп.ОсновнаяВитринаСервиса(Сервис);
        КонецЕсли; 
    КонецЕсли; 
    
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
    
    ТекстХранилище = Новый ХранилищеЗначения(ОбъектКопирования.ТекстХранилище.Получить(), Новый СжатиеДанных(9));
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
